FIOLOG/nvme0n1_220606_144406_fio.log
/dev/nvme0n1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.28
Starting 2 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=821884: Mon Jun  6 14:44:16 2022
  read: IOPS=212k, BW=828MiB/s (868MB/s)(8279MiB/10001msec)
    slat (nsec): min=1693, max=432545, avg=2772.30, stdev=1657.56
    clat (usec): min=36, max=3773, avg=147.76, stdev=86.48
     lat (usec): min=39, max=3780, avg=150.60, stdev=86.53
    clat percentiles (usec):
     |  1.00th=[   63],  5.00th=[   69], 10.00th=[   74], 20.00th=[   83],
     | 30.00th=[   92], 40.00th=[  106], 50.00th=[  123], 60.00th=[  141],
     | 70.00th=[  165], 80.00th=[  200], 90.00th=[  258], 95.00th=[  314],
     | 99.00th=[  453], 99.50th=[  506], 99.90th=[  635], 99.95th=[  709],
     | 99.99th=[ 1696]
   bw (  KiB/s): min=774656, max=854936, per=50.00%, avg=847825.68, stdev=17802.20, samples=19
   iops        : min=193666, max=213734, avg=211956.53, stdev=4450.09, samples=19
  lat (usec)   : 50=0.04%, 100=35.88%, 250=53.17%, 500=10.38%, 750=0.50%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.01%
  cpu          : usr=33.74%, sys=57.18%, ctx=175613, majf=0, minf=43
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=2119305,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=821885: Mon Jun  6 14:44:16 2022
  read: IOPS=212k, BW=828MiB/s (868MB/s)(8283MiB/10001msec)
    slat (nsec): min=1711, max=505739, avg=2783.84, stdev=1692.72
    clat (usec): min=36, max=3677, avg=147.67, stdev=86.50
     lat (usec): min=40, max=3684, avg=150.52, stdev=86.55
    clat percentiles (usec):
     |  1.00th=[   63],  5.00th=[   69], 10.00th=[   74], 20.00th=[   83],
     | 30.00th=[   92], 40.00th=[  106], 50.00th=[  123], 60.00th=[  141],
     | 70.00th=[  165], 80.00th=[  200], 90.00th=[  258], 95.00th=[  314],
     | 99.00th=[  453], 99.50th=[  506], 99.90th=[  644], 99.95th=[  717],
     | 99.99th=[ 1713]
   bw (  KiB/s): min=776568, max=855064, per=50.04%, avg=848472.42, stdev=17466.15, samples=19
   iops        : min=194142, max=213766, avg=212118.11, stdev=4366.54, samples=19
  lat (usec)   : 50=0.05%, 100=35.94%, 250=53.15%, 500=10.33%, 750=0.50%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=0.02%, 4=0.01%
  cpu          : usr=33.32%, sys=57.92%, ctx=169744, majf=0, minf=45
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=2120455,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=1656MiB/s (1736MB/s), 828MiB/s-828MiB/s (868MB/s-868MB/s), io=16.2GiB (17.4GB), run=10001-10001msec

Disk stats (read/write):
  nvme0n1: ios=4196093/0, merge=0/0, ticks=565729/0, in_queue=565729, util=99.06%